Tekla.Structures.Model.Fitting
The Fitting class defines how the part end fits to a plane.  A fitting can make the part either longer or shorter.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point Point = new Point(0, 0, 0);
Point Point2 = new Point(1000, 0, 0);
Beam Beam = new Beam();
Beam.StartPoint = Point;
Beam.EndPoint = Point2;
Beam.Profile.ProfileString = "HEA400";
Beam.Finish = "PAINT";
Beam.Insert();
Fitting Fitting = new Fitting();
Fitting.Plane = new Plane();
Fitting.Plane.Origin = new Point(500, 0, 0);
Fitting.Plane.AxisX = new Vector(0, 1000, 0);
Fitting.Plane.AxisY = new Vector(0, 0, -1000);
Fitting.Father = Beam;
Fitting.Insert();
}
}

Tekla.Structures.Model.Fitting.Plane
The plane that fits the part.

Tekla.Structures.Model.Fitting.#ctor
Initializes a new instance of the Fitting class with empty attributes.

Tekla.Structures.Model.Fitting.Insert
Inserts the fitting into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.Fitting.Select
Selects a fitting from the model database. The fitting ID must be set.
Returns: True on success.

Tekla.Structures.Model.Fitting.Modify
Modifies the existing fitting in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Fitting.Delete
Deletes the fitting instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.Fitting.CreateInstance


Tekla.Structures.Model.Fitting.ModifyInstance


Tekla.Structures.Model.Fitting.SelectInstance


Tekla.Structures.Model.Fitting.ToStruct(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)


Tekla.Structures.Model.Fitting.FromStruct(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
